jvanderberg/PicoMiteAllVersions/ports/esp32_cyd/main/esp32_cyd_esp_lcd.c
int esp32_ili9341_lcd_ready(void) {
    return (s_panel != NULL || s_lcd != NULL) && Option.DISPLAY_TYPE == s_panel_type && HRes == s_w &&
           VRes == s_h;
}

int esp32_ili9341_lcd_fastgfx_ready(void) {
    return 0;
}

/* The no-PSRAM CYD presents straight to the panel; there is no off-screen
 * buffer to back an MMBasic FRAMEBUFFER, so the command is rejected. */
int esp32_ili9341_lcd_framebuffer_supported(void) {
    return 0;
}

static void bind_panel(void) {
    HRes = DisplayHRes = s_w;
    VRes = DisplayVRes = s_h;
    ScreenSize = s_w * s_h;
    Option.DISPLAY_TYPE = s_panel_type;
    DISPLAY_TYPE = s_panel_type;
    Option.DISPLAY_CONSOLE = 1;
    Option.Refresh = 0;
    OptionConsole = 3;
    DrawPixel = esp_lcd_draw_pixel;
    DrawRectangle = esp_lcd_draw_rectangle;
    DrawBitmap = esp_lcd_draw_bitmap;
    DrawBuffer = esp_lcd_draw_buffer;
    DrawBLITBuffer = esp_lcd_draw_buffer;
    DrawBufferFast = esp_lcd_draw_buffer_fast;
    if (s_rd) {
        /* Readback is available for PIXEL()/sprites and for console scroll.
         * Use the CYD-local scroll implementation; the shared SPI-LCD scroll
         * path assumes the Pico SPI backend state and can blank the console. */
        ReadBuffer = esp_lcd_read_buffer;
        ReadBLITBuffer = esp_lcd_read_buffer;
        ReadBufferFast = esp_lcd_read_buffer_fast;
        ScrollLCD = esp32_ili9341_lcd_scroll;
        Option.NoScroll = 0;
    } else {
        /* No MISO / read device: PIXEL()/sprites/transparent error cleanly and
         * the console clear-homes on overflow instead of scrolling. */
        ReadBuffer = (void (*)(int, int, int, int, unsigned char *))DisplayNotSet;
        ReadBLITBuffer = (void (*)(int, int, int, int, unsigned char *))DisplayNotSet;
        ReadBufferFast = (void (*)(int, int, int, int, unsigned char *))DisplayNotSet;
        ScrollLCD = (void (*)(int))DisplayNotSet;
        Option.NoScroll = 1;
    }
}

int esp32_ili9341_lcd_restore_panel(void) {
    if (!s_lcd && !s_panel) return 0;
    bind_panel();
    esp32_board_profile_reserve_lcd_pins();
    return 1;
}

void esp32_ili9341_lcd_flush_pending(void) {}

static void esp_lcd_error_restore_console_surface(void) {
    if (!esp32_ili9341_lcd_restore_panel()) return;
    Option.DISPLAY_CONSOLE = 1;
    OptionConsole = 3;
    ApplyDefaultConsoleColours();
    CurrentX = 0;
    CurrentY = 0;
}

/* Console scroll with no shadow buffer: read each shifted row straight off the
 * panel and redraw it, then fill the vacated band with the background. Only
 * bound when the read device exists (otherwise the console clear-homes). */
void esp32_ili9341_lcd_scroll(int lines) {
    if (!s_rd || lines == 0) return;
    ScrollStart = 0;
    int n = lines < 0 ? -lines : lines;
    if (n >= s_h) {
        esp_lcd_draw_rectangle(0, 0, s_w - 1, s_h - 1, gui_bcolour);
        return;
    }
    static uint8_t row[LCD_W * 3]; /* one BGR row, off-stack */
    if (lines > 0) {
        for (int y = 0; y < s_h - lines; y++) {
            panel_read_region(0, y + lines, s_w - 1, y + lines, row);
            esp_lcd_draw_buffer(0, y, s_w - 1, y, row);
        }
        esp_lcd_draw_rectangle(0, s_h - lines, s_w - 1, s_h - 1, gui_bcolour);
    } else {
        for (int y = s_h - 1; y >= n; y--) {
            panel_read_region(0, y - n, s_w - 1, y - n, row);
            esp_lcd_draw_buffer(0, y, s_w - 1, y, row);
        }
        esp_lcd_draw_rectangle(0, 0, s_w - 1, n - 1, gui_bcolour);
    }
}

void esp32_ili9341_lcd_snapshot_rgb121(uint8_t * out) {
    (void)out;
}

static uint8_t * lcd_present_batch_buffer(int width, int * rows_per_batch) {
    int rows = SCRATCH_PX / width;
    if (rows < 1) rows = 1;
    if (rows_per_batch) *rows_per_batch = rows;
    return s_scratch;
}

void esp32_ili9341_lcd_present_rgb121_diff(uint8_t * back, uint8_t * front) {
    (void)back;
    (void)front;
}

void esp32_ili9341_lcd_present_rgb121_rect(const uint8_t * src, int xs, int xe, int ys, int ye, int odd) {
    if (!esp32_ili9341_lcd_ready() || !s_scratch || !src) return;
    int src_w = xe - xs + 1;
    if (src_w <= 0) return;
    int cx1 = xs, cy1 = ys, cx2 = xe, cy2 = ye;
    if (!clip_rect(&cx1, &cy1, &cx2, &cy2)) return;
    int w = cx2 - cx1 + 1;
    int h = cy2 - cy1 + 1;
    int rows_per_batch;
    uint8_t * tx = lcd_present_batch_buffer(w, &rows_per_batch);

    for (int yoff = 0; yoff < h;) {
        int rows = h - yoff;
        if (rows > rows_per_batch) rows = rows_per_batch;
        for (int ry = 0; ry < rows; ry++) {
            int y = cy1 + yoff + ry;
            int src_row_base = (y - ys) * src_w;
            uint8_t * out = tx + (size_t)ry * (size_t)w * 2u;
            for (int x = cx1; x <= cx2; x++) {
                int src_index = src_row_base + (x - xs);
                int packed_index = src_index + (odd ? 1 : 0);
                uint8_t byte = src[(size_t)packed_index >> 1];
                uint8_t nibble = (packed_index & 1) ? (uint8_t)(byte >> 4)
                                                    : (uint8_t)(byte & 0x0f);
                put565(&out[(size_t)(x - cx1) * 2u], rgb121_palette_colour(nibble));
            }
        }
        panel_blit(cx1, cy1 + yoff, cx2, cy1 + yoff + rows - 1, tx);
        yoff += rows;
    }
}

static int lcd_option_gpio(int pin) {
    if (pin <= 0 || pin > NBRPINS || (PinDef[pin].mode & UNUSED)) return -1;
    return PinDef[pin].GPno;
}

static void lcd_release_resources(int bus_inited) {
    if (s_rd) {
        (void)spi_bus_remove_device(s_rd);
        s_rd = NULL;
    }
    if (s_lcd) {
        (void)spi_bus_remove_device(s_lcd);
        s_lcd = NULL;
    }
    if (s_panel) {
        (void)esp_lcd_panel_del(s_panel);
        s_panel = NULL;
    }
    if (s_io) {
        (void)esp_lcd_panel_io_del(s_io);
        s_io = NULL;
    }
    if (bus_inited) (void)spi_bus_free(LCD_SPI_HOST);
    if (s_scratch) {
        heap_caps_free(s_scratch);
        s_scratch = NULL;
    }
    if (s_rdbuf) {
        heap_caps_free(s_rdbuf);
        s_rdbuf = NULL;
    }
    s_dc = -1;
    s_cs = -1;
}

void esp32_ili9341_lcd_init(void) {
    if (Option.WebConsole || s_lcd || s_panel) return;
    if (!Option.LCD_CD || !Option.LCD_CS) return;
    const int sclk = lcd_option_gpio(Option.LCD_CLK);
    const int mosi = lcd_option_gpio(Option.LCD_MOSI);
    const int miso = lcd_option_gpio(Option.LCD_MISO);
    const int cs = lcd_option_gpio(Option.LCD_CS);
    const int dc = lcd_option_gpio(Option.LCD_CD);
    const int rst = lcd_option_gpio(Option.LCD_Reset);
    const int backlight = lcd_option_gpio(Option.DISPLAY_BL);
    if (sclk < 0 || mosi < 0 || cs < 0 || dc < 0) {
        ESP_LOGW(TAG, "LCD pins incomplete");
        return;
    }

    s_panel_type = (Option.DISPLAY_TYPE == ST7789B) ? ST7789B : ILI9341;
    if (Option.DISPLAY_ORIENTATION & 1) {
        s_w = LCD_W;
        s_h = LCD_H;
    } else {
        s_w = LCD_H;
        s_h = LCD_W;
    }

    spi_bus_config_t bus = {
        .mosi_io_num = mosi,
        .miso_io_num = miso,
        .sclk_io_num = sclk,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = SCRATCH_PX * 3 + 16,
    };
    esp_err_t err = spi_bus_initialize(LCD_SPI_HOST, &bus, SPI_DMA_CH_AUTO);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "spi_bus_initialize failed: %s", esp_err_to_name(err));
        return;
    }

    esp_lcd_panel_io_spi_config_t io_cfg = {
        .cs_gpio_num = cs,
        .dc_gpio_num = dc,
        .spi_mode = 0,
        .pclk_hz = LCD_SPI_HZ,
        .trans_queue_depth = 10,
        .lcd_cmd_bits = 8,
        .lcd_param_bits = 8,
    };
    err = esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)LCD_SPI_HOST, &io_cfg,
                                   &s_io);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "panel_io_spi failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }

