jvanderberg/PicoMiteAllVersions/ports/esp32_cyd/main/esp32_cyd_esp_lcd.c
    s_dc = dc;

    /* Keep the same MADCTL colour-order bit as the known-working CYD init.
     * The visible red/blue swap is corrected in the pixel packer, not by
     * changing panel init state. */
    esp_lcd_panel_dev_config_t panel_cfg = {
        .reset_gpio_num = rst, /* -1 if none (software reset is used) */
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_RGB,
        .bits_per_pixel = 16,
    };
    err = esp_lcd_new_panel_st7789(s_io, &panel_cfg, &s_panel);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "new_panel_st7789 failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }

    err = esp_lcd_panel_reset(s_panel);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "panel reset failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }
    err = esp_lcd_panel_init(s_panel);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "panel init failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }
    /* CYD2USB ST7789 wants inversion off; OPTION INVERT (Option.BGR=1) means
     * "no inversion" on this controller, matching the old ST7789 path. */
    err = esp_lcd_panel_invert_color(s_panel, !Option.BGR);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "panel invert failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }
    /* Landscape = swap X/Y; flip the mirror for the 180° variants. */
    int landscape = Option.DISPLAY_ORIENTATION & 1;
    int flip = (Option.DISPLAY_ORIENTATION == RLANDSCAPE ||
                Option.DISPLAY_ORIENTATION == RPORTRAIT);
    err = esp_lcd_panel_swap_xy(s_panel, landscape);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "panel swap_xy failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }
    err = esp_lcd_panel_mirror(s_panel, landscape ^ flip, flip);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "panel mirror failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }
    err = esp_lcd_panel_disp_on_off(s_panel, true);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "panel display-on failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }

    esp_lcd_panel_del(s_panel);
    s_panel = NULL;
    esp_lcd_panel_io_del(s_io);
    s_io = NULL;

    s_dc = dc;
    s_cs = cs;
    gpio_config_t out = {
        .pin_bit_mask = (1ULL << (uint32_t)s_dc) | (1ULL << (uint32_t)s_cs),
        .mode = GPIO_MODE_OUTPUT,
    };
    err = gpio_config(&out);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "gpio_config failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }
    gpio_set_level((gpio_num_t)s_cs, 1);

    spi_device_interface_config_t wr_cfg = {
        .clock_speed_hz = LCD_SPI_HZ,
        .mode = 0,
        .spics_io_num = -1,
        .queue_size = 1,
        .flags = SPI_DEVICE_NO_DUMMY,
    };
    err = spi_bus_add_device(LCD_SPI_HOST, &wr_cfg, &s_lcd);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "LCD write device add failed: %s", esp_err_to_name(err));
        lcd_release_resources(1);
        return;
    }

    spi_device_interface_config_t rd_cfg = {
        .clock_speed_hz = LCD_SPI_RD_HZ,
        .mode = 0,
        .spics_io_num = -1,
        .queue_size = 1,
        .input_delay_ns = LCD_RD_INPUT_DELAY_NS,
    };
    if (miso >= 0) {
        err = spi_bus_add_device(LCD_SPI_HOST, &rd_cfg, &s_rd);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "RAMRD read device add failed; reads disabled: %s",
                     esp_err_to_name(err));
            s_rd = NULL;
        }
    }

    if (!s_scratch)
        s_scratch = heap_caps_malloc(SCRATCH_PX * 2u,
                                     MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
    if (!s_scratch) {
        ESP_LOGE(TAG, "LCD scratch allocation failed");
        lcd_release_resources(1);
        return;
    }
    if (s_rd && !s_rdbuf)
        s_rdbuf = heap_caps_malloc(1 + READ_SCRATCH_PX * 3,
                                   MALLOC_CAP_DMA | MALLOC_CAP_8BIT);
    if (s_rd && !s_rdbuf) {
        ESP_LOGW(TAG, "RAMRD scratch allocation failed; reads disabled");
        (void)spi_bus_remove_device(s_rd);
        s_rd = NULL;
    }

    if (backlight >= 0) esp32_backlight_init_default();

    bind_panel();
    Option.DefaultFont = 0x01;
    Option.ColourCode = 1;
    if (Option.DefaultFC == 0 && Option.DefaultBC == 0) {
        Option.DefaultFC = WHITE;
        Option.DefaultBC = BLACK;
    }
    esp32_board_profile_reserve_lcd_pins();
    port_set_error_restore_console_surface_callback(esp_lcd_error_restore_console_surface);
    ApplyDefaultConsoleColours();
    CurrentX = 0;
    CurrentY = 0;
    ClearScreen(gui_bcolour);
    ESP_LOGI(TAG, "esp_lcd ST7789 ready: %dx%d sclk=%d mosi=%d miso=%d cs=%d dc=%d",
             s_w, s_h, sclk, mosi, miso, cs, dc);
    /* The CYD presents to glass on every draw — no off-screen buffer — so the
     * manual REFRESH command is a no-op and OPTION DISPLAY AUTOREFRESH ON is
     * rejected. */
    port_display_supports_manual_refresh = 0;
}
